# DBMS MINI PROJECT 
#TITLE : MOVIES DATABASE
#PARTICIPANTS:
**ROLLNO.  (NAME)**

**5.   SUDARSHAN S PARANJAPE**

**10.   JAY D PATEL**

**14.   SHRIPAD R PATHRE**

# MOVIES DATABASE
---
# Following are the ENTITIES used 
---


*  MOVIE(***mov_id***,  mov_name,  mov_year,  mov_time,  mov_lang,  rel_date,  mov_awards)

*  ACTOR (***act_id***,  act_name,  act_gender,  act_age,  act_award) 

*  DIRECTOR(***dir_id***,  dir_name,  mov_id,  award_won)

*  PROD_COMP(***prod_id***,  producer_name,  prod_budget,  prod_city)

*  RATING(  ***rating_comp***,mov_rating)

---

# Following are the relationships:

*   ACTS IN (m:n actors act in movies ; total participation on both sides)
*   DIRECTED BY( m:n dir direct movies ; movie total director partial)
*   PRODUCED BY (1:m production can produce many movies ; prod total movie   total)
*   HAS (1:m 1 rating for many movies ; movie partial rating total)
*   Also an(m:m director also an actor ; both partial )
*

In [ ]:
import sqlite3

# New Section

# New Section

In [ ]:
import pandas as pd

In [ ]:
conn = sqlite3.connect('MOVIESDB.db')

print("Opened database successfully")

Opened database successfully

In [ ]:
cursor = conn.cursor()

CREATING TABLES

In [ ]:
#1
#docstring starts n ends with '''
# making table for movie
#MOVIE(mov_id,mov_name, mov_year, mov_time)
query = '''
CREATE TABLE IF NOT EXISTS MOVIE
(mov_id      INT                NOT NULL  PRIMARY KEY,
 mov_name    TEXT               NOT NULL,
 mov_time    TEXT               NOT NULL,
 mov_year    INT                NOT NULL)
'''

cursor.execute(query)

print("Table created successfully")

Table created successfully

In [ ]:
#2
# making table for actor
#ACTOR (act_id,  act_name,  act_gender,  act_age,  act_award) 
query = '''
CREATE TABLE IF NOT EXISTS ACTOR
(act_id      INT  PRIMARY KEY   NOT NULL,
 act_name    TEXT               NOT NULL,
 act_gender  TEXT               NOT NULL,
 act_age     INT                NOT NULL,
 act_award   INT                NOT NULL)
'''

cursor.execute(query)

print("Table created successfully")

Table created successfully

In [ ]:
#3
#DIRECTOR(dir_id,dir_name,award_won)
query = '''
CREATE TABLE IF NOT EXISTS DIRECTOR
(dir_id      INT  PRIMARY KEY   NOT NULL,
 dir_name    TEXT               NOT NULL,
 nationality TEXT               NOT NULL )
'''

cursor.execute(query)

print("Table created successfully")

Table created successfully

In [ ]:
#4
# PROD_COMP(***prod_id***,  producer_name,  prod_budget,  prod_city)

query = '''
 CREATE TABLE IF NOT EXISTS PROD_COMP(
 prod_id      INT  PRIMARY KEY   NOT NULL,
 prod_name    TEXT               NOT NULL,
 producer_name TEXT                NOT NULL)'''

cursor.execute(query)

print("Table created successfully")

Table created successfully

In [ ]:
#6
# create table ACTS_IN(act_id,mov_id)
query = '''
 CREATE TABLE IF NOT EXISTS ACTS_IN(
   act_id          INT                NOT NULL,
   mov_id          INT                NOT NULL,
   PRIMARY KEY (mov_id,act_id)
   FOREIGN KEY(mov_id) REFERENCES MOVIE,
   FOREIGN KEY(act_id) REFERENCES ACTOR)
   '''

cursor.execute(query)

In [ ]:
#7
#create table ALSO_AN(dir_id, act_id)
query = '''
 CREATE TABLE IF NOT EXISTS ALSO_AN(
   dir_id          INT                NOT NULL,
   act_id          INT                NOT NULL,
   PRIMARY KEY (act_id,dir_id)
   FOREIGN KEY(act_id) REFERENCES MOVIE,
   FOREIGN KEY(dir_id) REFERENCES ACTOR)
   '''

cursor.execute(query)

In [ ]:
#8
# create table Directed_By(dir_id, mov_id)
query = '''
 CREATE TABLE IF NOT EXISTS DIRECTED_BY(
   dir_id          INT                NOT NULL,
   mov_id          INT                NOT NULL,
   PRIMARY KEY (mov_id,dir_id)
   FOREIGN KEY(mov_id) REFERENCES MOVIE,
   FOREIGN KEY(dir_id) REFERENCES ACTOR)
   '''

cursor.execute(query)

In [ ]:
 #5
 #RATING(mov_rating, mov_id(foreign key))

 query = '''
 CREATE TABLE IF NOT EXISTS RATING(
   mov_id                      INT PRIMARY KEY   NOT NULL,
   mov_rating                  INT                NOT NULL,
   number_of_rating            INT                NOT NULL,
   FOREIGN KEY(mov_id) REFERENCES MOVIE )
   '''
cursor.execute(query)

print("Table created successfully")

Table created successfully

In [ ]:
#9
#create tab HAS
query = '''
 CREATE TABLE IF NOT EXISTS HAS(
   mov_id            INT                NOT NULL,
   mov_rating        INT                NOT NULL
   number_of_rating  
   '''

cursor.execute(query)

OperationalError: ignored

POPULATING DATA

In [ ]:
insert_query2 = ''' 
INSERT INTO ACTOR (act_id,act_name, act_gender, act_age, act_award)
VALUES ('111','Daniel Craig', 'Male','53', 'BAFTA best actor in leading role'),
       ('112', 'Robert Downey Jr.' , 'Male' ,'55', 'Golden globe award for best actor'),
       ('113', 'Scarlett Johannson', 'Female', '36', 'MTV Movie Award for Best Fight'),
       ('114', 'Nicole Kidman', 'female', '53', 'Academy Award for Best Actress in a Leading Role'),
       ('115', 'Mark Ruffalo' , 'Male', '53','MTV Movie Award for Best Fight'),
       ('116', 'Emma watson', 'Female', '30', 'Teen choice award for best movie'),
       ('117', 'Marlon Brando', 'Male', '80', 'Acedemy award for besyt actor in leading role'),
       ('118', 'Gal Gadot', 'Female', '35','C Award'),
       ('119', 'Mel Gibson', 'Male', '35','Critice Seeher Award'),
       ('120', 'Bradley Cooper', 'Make', '35','Critics Cheher Award'),
       ('121', 'Ben Affleck', 'Male', '35','Critics Choice Sr Award'),
       ('122', 'Angelina Jolie', 'Female', '35','Choice Seeher Award')


'''

cursor.execute(insert_query2)

In [ ]:
insert_query3 =''' 
INSERT INTO DIRECTOR (dir_id, dir_name, nationality)
VALUES    ('D01', 'Zack Snyder', 'American'),
					('D02', 'Sam Mendes', 'American'),
					('D03', 'Jon Favreau', 'Australian'),
					('D04', 'Taika Waititi', 'American'),
					('D05', 'James Wan', 'American'),
					('D06', 'Louis Leterrier', 'American'),
					('D07', 'Bill Condon', 'British'),
					('D08', 'Francis Ford Coppola', 'British'),
          ('D09', 'Patty Jenkins', 'British'),
          ('D10', 'Guy Ritchie', 'American'),
          ('D11', 'Daivd Fincher', 'British'),
          ('D12', 'Martin Scorsese', 'American'),
          ('D13', 'James Cameron', 'Canadian'),
          ('D14', 'Jon M Chu ', 'Canadian'),
          ('D15', 'Lana Wachowski', 'British'),
          ('D16', 'Chad Stahelski', 'British'),
          ('D17', 'Joss Whedon', 'British'),
          ('D18', 'Chris Columbus', 'British'),
          ('D19', 'Brian De Palma', 'British'),
          ('D20', 'Martin Campbell', 'American'),
          ('D21', 'David Sandberg', 'Canadian'),
          ('D22', 'George Lucas', 'British'),
          ('D23', 'Josh Boone', 'Australian'),
          ('D24', 'Christopher Nolan', 'British'),
          ('D25', 'Mel Gibson', 'American'),
          ('D26', 'Bradley Cooper','American'),
          ('D27', 'Ben Affleck','American'),
          ('D28', 'Angelina Jolie','American')
          
          '''

cursor.execute(insert_query3)

In [ ]:
insert_query = ''' 
 INSERT INTO MOVIE (mov_id,mov_name, mov_year, mov_time)
 VALUES ('M01','SKYFALL',2010,'2hrs'),
       ('M02', 'Iron Man', '2008' ,'2hrs 6min'),
       ('M03', 'Jojo Rabbit', '2019','1hr 48min'),
       ('M04', 'aquaman','2018','2hr 22min'),
       ('M05', 'Now You See Me', '2013', '2hr 5min'),
       ('M06', 'Beauty and the beast', '2017', '2hr 10min'),
       ('M07', 'The Godfather', '1972', '2hr 58min'),
       ('M08', 'Wonder woman', '2017', '2hr 29min'),
       ('M09', 'Sherlock Holmes', '2010', '2hr 9min'),
       ('M10', 'Zodiac', '2007', '2hr 42min'),
       ('M11', 'Shutter Island', '2010', '2hr 19min'),
       ('M12', 'Titanic', '1997', '3hr 30min'),
       ('M13', 'Now You See Me 2', '2016', '2hr 10min'),
       ('M14', 'Matrix', '1999', '2hr 30min'),
       ('M15', 'John Wick', '2014', '1hr 42min'),
       ('M16', 'Avengers', '2012', '2hr 24min'),
       ('M17', 'Harry Potter and The Philosophers Stone', '2001', '2hr 39min'),
       ('M18', 'Thor : Ragnarok', '2017', '2hr 10min'),
       ('M19', 'Scarface', '1983', '2hr 50min'),
       ('M20', 'Casino Royale', '2006', '2hr 25min'),
       ('M21', 'Lights Out', '2016', '1hr 21min'),
       ('M22', 'Star Wars Episode 1', '1999', '2hr 16min'),
       ('M23', 'Interstellar', '2014', '2hr 49min'),
       ('M24', 'Conjuring', '2013', '1hr 52min'),
       ('M25', 'The Fault In Our Stars', '2014', '2hr 13min'),
       ('M26', 'A Star Is Born', '2018', '2hr 35min'),
       ('M27', 'Braveheart', '1995', '3hr 02min'),
       ('M28', 'By The Sea', '2015', '2hr 13min'),
       ('M29', 'Argo', '2012', '2hr 10min')'''



cursor.execute(insert_query)

In [ ]:
i1 =''' 
 INSERT INTO PROD_COMP (prod_id, prod_name, producer_name)
 VALUES ('P01','Columbia Pictures','Micheal Wilson'), 
       ('P02','Marvel Studios','Kevin Feige'),
       ('P03','Piki Films','Taika Waititi'), ('P04','DC Films','Peter Safran'),
       ('P05','Summit Entertainment','Bobby Cohen'),
       ('P06','Walt Disney Pictures','David Hoberman'),
       ('P07','Columbia Pictures','Micheal Wilson'),
       ('P08','DC Films','Zack Shnyder'),
       ('P09','Paramount Pictures','Albert Ruddy'),
       ('P10','Warner Bros Pictures','Susan Downey'),
       ('P11','DC Films','Peter Safran'),
       ('P12','Warner Bros Pictures','Brad Fischer'),
       ('P13','Paramount Pictures','Martin Scorsese'),
       ('P14','Paramount Pictures','James Cameron'),
       ('P15','Summit Entertainment','Bobby Cohen'),
       ('P16','Warner Bros Pictures','Joel Silver'),
       ('P17','Summit Entertainment','Eva Longoria'),
       ('P18','Warner Bros Pictures','David Hayman'),
       ('P19','Cado Company','Martin Regman'),
       ('P20','New Line Cinema','James Wan'),
       ('P21','Lucas Films','Rick McCallum'),
       ('P22','Warner Bros Pictures','Christopher Nolan'),
       ('P23','New Line Cinema','Rob Cowan'),
       ('P24','Fox 2000 Pictures','Marty Bowen'),
       ('P25','Eros International','Kishore Lulla')
      
       '''


cursor.execute(i1)

In [ ]:
insert = '''
INSERT INTO RATING(mov_id,mov_rating,number_of_rating)
VALUES ('M01', '7.9', '633921'),
      ('M02', '7.9', '950717'),
      ('M03', '7.7', '210485'),
      ('M04', '6.9', '386223'),
      ('M05', '7.3', '601032'),
      ('M06', '7.1', '277742'),
      ('M07', '9.2', '16411'),
      ('M08', '7.4', '583071'),
      ('M09', '7.6', '586914'),
      ('M10', '7.7', '474136'),
      ('M11', '8.2', '11471'),
      ('M12', '7.8', '10573'),
      ('M13', '6.5', '‎312673'),
      ('M14', '8.7', '‎229762'),
      ('M15', '7.4', '546652'),
      ('M16', '8.1', '‎127536'),
      ('M17', '7.6', '667414'),
      ('M18', '7.9', '‎602382'),
      ('M19', '8.3', '750706'),
      ('M20', '8.3', '750706'),
      ('M21', '6.3', '116221'),
      ('M22', '6.5', '‎73700'),
      ('M23', '8.6', '1538047'),
      ('M24', '7.5', '446591'),
      ('M25', '7.7', '347173'),
      ('M26', '7.6', '340153'),
      ('M27', '8.3', '9670'),
      ('M28', '5.3', '18962'),
      ('M29', '6.7', '577738')
     
     '''

cursor.execute(insert)

In [ ]:
insert = '''
INSERT INTO ACTS_IN(act_id,mov_id)
VALUES ('111','M01'),
       ('111','M20'),
       ('112','M02'),
       ('112','M09'),
       ('112','M16'),
       ('112','M10'),
       ('113','M16'),
       ('113','M03'),
       ('114','M04'),
       ('115','M05'),
       ('115','M10'),
       ('115','M13'),
       ('115','M16'),
       ('116','M06'),
       ('116','M17'),
       ('117','M07'),
       ('118','M08'),
       ('119','M27'),
       ('120','M26'),
       ('121','M29'),
       ('122','M28')
        '''


cursor.execute(insert)

In [ ]:
insert = '''
INSERT INTO DIRECTED_BY(dir_id,mov_id)
VALUES ('D02','M01'),
       ('D03','M02'),
       ('D04','M03'),
       ('D05','M04'),
       ('D06','M05'),
       ('D07','M06'),
       ('D08','M07'),
       ('D09','M08'),
       ('D10','M09'),
       ('D11','M10'),
       ('D12','M11'),
       ('D13','M12'),
       ('D14','M13'),
       ('D14','M14'),
       ('D16','M15'),
       ('D17','M16'),
       ('D18','M17'),
       ('D04','M18'),
       ('D19','M19'),
       ('D20','M20'),
       ('D21','M21'),
       ('D22','M22'),
       ('D24','M23'),
       ('D05','M24'),
       ('D23','M25'),
       ('D26','M26'),
       ('D25','M27'),
       ('D28','M28'),
       ('D27','M29')

       '''


cursor.execute(insert)

In [ ]:
insert = '''
INSERT INTO ALSO_AN(dir_id,act_id)
VALUES ('D25','119'),
       ('D26','120'),
       ('D27','121'),
       ('D28','122') '''


cursor.execute(insert)

BURRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR

In [ ]:
qB = '''SELECT * FROM DIRECTOR'''

execute = pd.read_sql_query(qB, conn)
execute

   dir_id              dir_name nationality
0     D01           Zack Snyder    American
1     D02            Sam Mendes    American
2     D03           Jon Favreau  Australian
3     D04         Taika Waititi    American
4     D05             James Wan    American
5     D06       Louis Leterrier    American
6     D07           Bill Condon     British
7     D08  Francis Ford Coppola     British
8     D09         Patty Jenkins     British
9     D10           Guy Ritchie    American
10    D11         Daivd Fincher     British
11    D12       Martin Scorsese    American
12    D13         James Cameron    Canadian
13    D14            Jon M Chu     Canadian
14    D15        Lana Wachowski     British
15    D16        Chad Stahelski     British
16    D17           Joss Whedon     British
17    D18        Chris Columbus     British
18    D19        Brian De Palma     British
19    D20       Martin Campbell    American
20    D21        David Sandberg    Canadian
21    D22          George Lucas     British
22    D23            Josh Boone  Australian
23    D24     Christopher Nolan     British
24    D25            Mel Gibson    American
25    D26        Bradley Cooper    American
26    D27           Ben Affleck    American
27    D28        Angelina Jolie    American

In [ ]:
qR = '''SELECT * FROM MOVIE'''


execute = pd.read_sql_query(qR, conn)
execute

   mov_id                                 mov_name   mov_time  mov_year
0     M01                                  SKYFALL       2hrs      2010
1     M02                                 Iron Man  2hrs 6min      2008
2     M03                              Jojo Rabbit  1hr 48min      2019
3     M04                                  aquaman  2hr 22min      2018
4     M05                           Now You See Me   2hr 5min      2013
5     M06                     Beauty and the beast  2hr 10min      2017
6     M07                            The Godfather  2hr 58min      1972
7     M08                             Wonder woman  2hr 29min      2017
8     M09                          Sherlock Holmes   2hr 9min      2010
9     M10                                   Zodiac  2hr 42min      2007
10    M11                           Shutter Island  2hr 19min      2010
11    M12                                  Titanic  3hr 30min      1997
12    M13                         Now You See Me 2  2hr 10min      2016
13    M14                                   Matrix  2hr 30min      1999
14    M15                                John Wick  1hr 42min      2014
15    M16                                 Avengers  2hr 24min      2012
16    M17  Harry Potter and The Philosophers Stone  2hr 39min      2001
17    M18                          Thor : Ragnarok  2hr 10min      2017
18    M19                                 Scarface  2hr 50min      1983
19    M20                            Casino Royale  2hr 25min      2006
20    M21                               Lights Out  1hr 21min      2016
21    M22                      Star Wars Episode 1  2hr 16min      1999
22    M23                             Interstellar  2hr 49min      2014
23    M24                                Conjuring  1hr 52min      2013
24    M25                   The Fault In Our Stars  2hr 13min      2014
25    M26                           A Star Is Born  2hr 35min      2018
26    M27                               Braveheart  3hr 02min      1995
27    M28                               By The Sea  2hr 13min      2015
28    M29                                     Argo  2hr 10min      2012

In [ ]:
qE = '''SELECT * FROM PROD_COMP'''

execute = pd.read_sql_query(qE, conn)
execute

   prod_id             prod_name      producer_name
0      P01     Columbia Pictures     Micheal Wilson
1      P02        Marvel Studios        Kevin Feige
2      P03            Piki Films      Taika Waititi
3      P04              DC Films       Peter Safran
4      P05  Summit Entertainment        Bobby Cohen
5      P06  Walt Disney Pictures     David Hoberman
6      P07     Columbia Pictures     Micheal Wilson
7      P08              DC Films       Zack Shnyder
8      P09    Paramount Pictures       Albert Ruddy
9      P10  Warner Bros Pictures       Susan Downey
10     P11              DC Films       Peter Safran
11     P12  Warner Bros Pictures       Brad Fischer
12     P13    Paramount Pictures    Martin Scorsese
13     P14    Paramount Pictures      James Cameron
14     P15  Summit Entertainment        Bobby Cohen
15     P16  Warner Bros Pictures        Joel Silver
16     P17  Summit Entertainment       Eva Longoria
17     P18  Warner Bros Pictures       David Hayman
18     P19          Cado Company      Martin Regman
19     P20       New Line Cinema          James Wan
20     P21           Lucas Films      Rick McCallum
21     P22  Warner Bros Pictures  Christopher Nolan
22     P23       New Line Cinema          Rob Cowan
23     P24     Fox 2000 Pictures        Marty Bowen
24     P25    Eros International      Kishore Lulla

In [ ]:
qT = '''SELECT * FROM RATING'''

execute = pd.read_sql_query(qT, conn)
execute

   mov_id  mov_rating number_of_rating
0     M01         7.9           633921
1     M02         7.9           950717
2     M03         7.7           210485
3     M04         6.9           386223
4     M05         7.3           601032
5     M06         7.1           277742
6     M07         9.2            16411
7     M08         7.4           583071
8     M09         7.6           586914
9     M10         7.7           474136
10    M11         8.2            11471
11    M12         7.8            10573
12    M13         6.5          ‎312673
13    M14         8.7          ‎229762
14    M15         7.4           546652
15    M16         8.1          ‎127536
16    M17         7.6           667414
17    M18         7.9          ‎602382
18    M19         8.3           750706
19    M20         8.3           750706
20    M21         6.3           116221
21    M22         6.5           ‎73700
22    M23         8.6          1538047
23    M24         7.5           446591
24    M25         7.7           347173
25    M26         7.6           340153
26    M27         8.3             9670
27    M28         5.3            18962
28    M29         6.7           577738

In [ ]:
qY = ''' SELECT * FROM ACTOR '''

execute = pd.read_sql_query(qY, conn)
execute

    act_id  ...                                         act_award
0      111  ...                  BAFTA best actor in leading role
1      112  ...                 Golden globe award for best actor
2      113  ...                    MTV Movie Award for Best Fight
3      114  ...  Academy Award for Best Actress in a Leading Role
4      115  ...                    MTV Movie Award for Best Fight
5      116  ...                  Teen choice award for best movie
6      117  ...     Acedemy award for besyt actor in leading role
7      118  ...                                           C Award
8      119  ...                              Critice Seeher Award
9      120  ...                              Critics Cheher Award
10     121  ...                           Critics Choice Sr Award
11     122  ...                               Choice Seeher Award

[12 rows x 5 columns]

In [ ]:
qA = '''SELECT * FROM ACTS_IN'''

execute = pd.read_sql_query(qA, conn)
execute

    act_id mov_id
0      111    M01
1      111    M20
2      112    M02
3      112    M09
4      112    M16
5      112    M10
6      113    M16
7      113    M03
8      114    M04
9      115    M05
10     115    M10
11     115    M13
12     115    M16
13     116    M06
14     116    M17
15     117    M07
16     118    M08
17     119    M27
18     120    M26
19     121    M29
20     122    M28

In [ ]:
qB = '''SELECT * FROM DIRECTED_BY'''

execute = pd.read_sql_query(qB, conn)
execute

   dir_id mov_id
0     D02    M01
1     D03    M02
2     D04    M03
3     D05    M04
4     D06    M05
5     D07    M06
6     D08    M07
7     D09    M08
8     D10    M09
9     D11    M10
10    D12    M11
11    D13    M12
12    D14    M13
13    D14    M14
14    D16    M15
15    D17    M16
16    D18    M17
17    D04    M18
18    D19    M19
19    D20    M20
20    D21    M21
21    D22    M22
22    D24    M23
23    D05    M24
24    D23    M25
25    D26    M26
26    D25    M27
27    D28    M28
28    D27    M29

insert = '''
INSERT INTO RATING(mov_id,mov_rating,number_of_rating)
VALUES ('M01', '7.9', '633921'),
      ('M02', '7.9', '950717'),
      ('M03', '7.7', '210485'),
      ('M04', '6.9', '386223'),
      ('M05', '7.3', '601032'),
      ('M06', '7.1', '277742'),
      ('M07', '9.2', '1641195'),
      ('M08', '7.4', ‎'583071'),
      ('M09', '7.6', '586914'),
      ('M10', '7.7', '474136'),
      ('M11', '8.2', '1147133'),
      ('M12', '7.8', '1057333'),
      ('M13', '6.5', '‎252673'),
      ('M14', '8.7', '‎1695762'),
      ('M15', '7.4', ‎'546652'),
      ('M16', '8.0', '‎1272836'),
      ('M17', '7.6', '667414'),
      ('M18', '7.9', '‎602382'),
      ('M19', '8.3', ‎'750706'),
      ('M20', '8.3', ‎'750706'),
      ('M21', '6.3', ‎'116221'),
      ('M22', '6.5', '‎738081'),
      ('M23', '8.6', ‎'1538047'),
      ('M24', '7.5', ‎'446591'),
      ('M25', '7.7', ‎'347173'),
     ('M26', '7.6', ‎'340153'),
      ('M27', '8.3', ‎'9670'),
     ('M28', '5.3', ‎'18962'),
     ('M29', '6.7', ‎'577738')
     
     '''

cursor.execute(insert)

QUERIES

In [ ]:
#Q1 : Display the list of movies in which actor is RDJ
q1 = ''' 
select A.act_name, M.mov_name
from actor as A, movie as M , acts_in as S
where S.act_id = A.act_id
and M.mov_id = S.mov_id
and A.act_name = 'Robert Downey Jr.'

'''

execute = pd.read_sql_query(q1, conn)
execute

            act_name         mov_name
0  Robert Downey Jr.         Iron Man
1  Robert Downey Jr.  Sherlock Holmes
2  Robert Downey Jr.         Avengers
3  Robert Downey Jr.           Zodiac

In [ ]:
# Display all the movies having rating greater than avg rating

q2 = '''
select mov_id, mov_name ,avg(rating)
from movie
where rating > avg(rating)
'''
execute = pd.read_sql_query(q2, conn)
execute

DatabaseError: ignored